backend/controllers/ProductController.php

	protected function findModel($id)
	{
		if (($model = Product::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `product` WHERE `id`='2'