backend/controllers/ShopController.php

SELECT * FROM `shop` WHERE `id` IN (4, 1, 1) OR `id` IS NULL
---
	protected function findModel($id)
	{
		if (($model = Shop::findOne(['id' => $id])) !== null) {